int main()
{
    int k,s,i,pos_1,pos_2,pos_3;
    float lim,x,max_1,max_2,max_3;
    printf("Δώσε αριθμό περιοχών \n");
    scanf("%i",&k);
    printf("Δώσε αποδεκτό μέσο ετήσιο αριθμό ημερών ηλιοφάνειας \n");
    scanf ("%f",&lim);
    max_1=0;
    max_2=0;
    max_3=0;
    s=0;
    for (i=1;i<=k;i++)
    {
        printf("Δώσε μέσο ετήσιο αριθμό των ημερών ηλιοφάνειας \n");
        scanf("%f",&x);
        if (x<lim)
        {
            printf("Η περιοχή %i έχει μικρότερο μέσο ετήσιο αριθμό των ημερών ηλιοφάνειας από τον ελάχιστο αποδεκτό \n",i);
            s++;
        }
        if (x>max_1)
        {
            max_1=x;
            pos_1=i;
        }
        else if (x>max_2)
        {
            max_2=x;
            pos_2=i;
        }
        else if (x>max_3)
        {
            max_3=x;
            pos_3=x;
        }
    }
    printf("Ο αριθμός των περιοχών με αποδεκτές τιμές ημερών ηλιοφάνειας είναι %i \n",k-s);
    if (s<k)
    {
        printf("Οι περιοχές με την μεγαλύτερη ηλιοφάνεια είναι: \n");
        if (max_3>0)
        {
            printf("1: H %i μέσο ετήσιο αριθμό των ημερών ηλιοφάνειας %f μέρες \n",pos_1,max_1);
            printf("2: H %i με μέσο ετήσιο αριθμό των ημερών ηλιοφάνειας %f μέρες \n",pos_2,max_2);
            printf("3: H %i με μέσο ετήσιο αριθμό των ημερών ηλιοφάνειας %f μέρες \n",pos_3,max_3);
        }
        else if (max_2>0)
        {
           printf("1: H %i με μέσο ετήσιο αριθμό των ημερών ηλιοφάνειας %f μέρες \n",pos_1,max_1);
           printf("2: H %i με μέσο ετήσιο αριθμό των ημερών ηλιοφάνειας %f μέρες \n",pos_2,max_2);
        }
        else if (max_1>0)
        {
           printf("H %i με μέσο ετήσιο αριθμό των ημερών ηλιοφάνειας %f μέρες \n",pos_1,max_1);
        }
    }
return 0;
}
